<?php
# ------------------------------------------------------------------------
# Define a separação dos diretórios.
# ------------------------------------------------------------------------
define('DS', DIRECTORY_SEPARATOR);

# ------------------------------------------------------------------------
# Define o diretório da aplicação.
# ------------------------------------------------------------------------
define('APPDIR', __DIR__);

# ------------------------------------------------------------------------
# Inicia o autload.
# ------------------------------------------------------------------------
require dirname(APPDIR) . DS . 'vendor' . DS . 'autoload.php';

# ------------------------------------------------------------------------
# Carrega as configurações da aplicação.
# ------------------------------------------------------------------------
require APPDIR . DS . 'config' . DS . 'config.php';

# ------------------------------------------------------------------------
# Carrega o arquivo de tradução de acordo com a configuração definida.
# ------------------------------------------------------------------------
require APPDIR .DS. 'i18n' .DS. Lib\Config::get('language') .DS. 'translation.php';

# ------------------------------------------------------------------------
# Inicializa a internacionalização da aplicação.
# ------------------------------------------------------------------------
Lib\Registry::getInstance()->set('I18n', new Lib\I18n);
Lib\Registry::getInstance()->get('I18n')->load($l);

# ------------------------------------------------------------------------
# Carrega as rotas da aplicação.
# ------------------------------------------------------------------------
require APPDIR . DS . 'config' . DS . 'routes.php';

# ------------------------------------------------------------------------
# Carrega as definições e inicializa o banco de dados.
# ------------------------------------------------------------------------
require APPDIR . DS . 'config' . DS . 'database.php';

?>